[
  {
    "course_id":64605,
    "course_title":"Introduction to Css",
    "num_subscribers":18324,
    "num_reviews":333,
    "num_lectures":16,
    "level":"Beginner Level",
    "content_duration":"1 hour",
    "published_timestamp":"2013-07-09T20:27:14Z",
    "subject":"Web Development",
    "main_technology":"css",
    "description":"The course '1 Hour CSS' is designed for learners interested in mastering Css. It provides a comprehensive understanding of Css concepts and hands-on applications. Suitable for beginner level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Css development skills. The course includes approximately 1 hour of on-demand video content. By the end, students will be able to build complete applications and apply Css skills professionally. With over 18,324 enrolled students and 333 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Css. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Css career. The course is available for 100, making it a great investment in your education.",
    "category":"frontend",
    "image":"css.png"
  },
  {
    "course_id":64422,
    "course_title":"Introduction to Html",
    "num_subscribers":16212,
    "num_reviews":514,
    "num_lectures":20,
    "level":"Beginner Level",
    "content_duration":"1 hour",
    "published_timestamp":"2013-07-09T03:16:26Z",
    "subject":"Web Development",
    "main_technology":"html",
    "description":"The course '1 Hour HTML' is designed for learners interested in mastering Html. It provides a comprehensive understanding of Html concepts and hands-on applications. Suitable for beginner level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Html development skills. The course includes approximately 1 hour of on-demand video content. By the end, students will be able to build complete applications and apply Html skills professionally. With over 16,212 enrolled students and 514 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Html. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Html career. The course is available for 200, making it a great investment in your education.",
    "category":"frontend",
    "image":"html.png"
  },
  {
    "course_id":63612,
    "course_title":"Introduction to Javascript",
    "num_subscribers":22999,
    "num_reviews":602,
    "num_lectures":18,
    "level":"Beginner Level",
    "content_duration":"1 hour",
    "published_timestamp":"2013-07-04T15:27:02Z",
    "subject":"Web Development",
    "main_technology":"javascript",
    "description":"The course '1 Hour JavaScript' is designed for learners interested in mastering Javascript. It provides a comprehensive understanding of Javascript concepts and hands-on applications. Suitable for beginner level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Javascript development skills. The course includes approximately 1 hour of on-demand video content. By the end, students will be able to build complete applications and apply Javascript skills professionally. With over 22,999 enrolled students and 602 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Javascript. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Javascript career. The course is available for 200, making it a great investment in your education.",
    "category":"frontend",
    "image":"javaScript.png"
  },
  {
    "course_id":665042,
    "course_title":"Comprehensive Guide to Ruby",
    "num_subscribers":5962,
    "num_reviews":466,
    "num_lectures":132,
    "level":"All Levels",
    "content_duration":"16 hours",
    "published_timestamp":"2016-03-08T07:36:40Z",
    "subject":"Web Development",
    "main_technology":"ruby",
    "description":"The course '8 Beautiful Ruby on Rails Apps in 30 Days & TDD - Immersive' is designed for learners interested in mastering Ruby. It provides a comprehensive understanding of Ruby concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Ruby development skills. The course includes approximately 16 hours of on-demand video content. By the end, students will be able to build complete applications and apply Ruby skills professionally. With over 5,962 enrolled students and 466 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Ruby. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Ruby career. The course is available for 100, making it a great investment in your education.",
    "category":"backend",
    "image":"ruby.png"
  },
  {
    "course_id":1023196,
    "course_title":"Comprehensive Guide to Laravel",
    "num_subscribers":3492,
    "num_reviews":61,
    "num_lectures":12,
    "level":"All Levels",
    "content_duration":"1.5 hours",
    "published_timestamp":"2016-12-06T22:07:53Z",
    "subject":"Web Development",
    "main_technology":"laravel",
    "description":"The course 'A Complete Laravel basics from beginner to expert' is designed for learners interested in mastering Laravel. It provides a comprehensive understanding of Laravel concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Laravel development skills. The course includes approximately 1.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Laravel skills professionally. With over 3,492 enrolled students and 61 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Laravel. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Laravel career. The course is available for 25, making it a great investment in your education.",
    "category":"framework",
    "image":"laravel.png"
  },
  {
    "course_id":425084,
    "course_title":"Comprehensive Guide to Sql",
    "num_subscribers":586,
    "num_reviews":65,
    "num_lectures":98,
    "level":"All Levels",
    "content_duration":"5.5 hours",
    "published_timestamp":"2015-03-23T00:20:29Z",
    "subject":"Web Development",
    "main_technology":"sql",
    "description":"The course 'Administering Microsoft SQL Server 2012 Databases - 70-462' is designed for learners interested in mastering Sql. It provides a comprehensive understanding of Sql concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Sql development skills. The course includes approximately 5.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Sql skills professionally. With over 586 enrolled students and 65 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Sql. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Sql career. The course is available for 60, making it a great investment in your education.",
    "category":"database",
    "image":"sql.png"
  },
  {
    "course_id":212398,
    "course_title":"Master Advanced Node Concepts",
    "num_subscribers":2565,
    "num_reviews":32,
    "num_lectures":41,
    "level":"Expert Level",
    "content_duration":"3 hours",
    "published_timestamp":"2014-08-28T03:35:30Z",
    "subject":"Web Development",
    "main_technology":"node",
    "description":"The course 'Advanced Node.js Development' is designed for learners interested in mastering Node. It provides a comprehensive understanding of Node concepts and hands-on applications. Suitable for expert level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Node development skills. The course includes approximately 3 hours of on-demand video content. By the end, students will be able to build complete applications and apply Node skills professionally. With over 2,565 enrolled students and 32 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Node. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Node career. The course is available for 55, making it a great investment in your education.",
    "category":"backend",
    "image":"node.png"
  },
  {
    "course_id":781532,
    "course_title":"Enhance Your React Skills",
    "num_subscribers":21998,
    "num_reviews":3326,
    "num_lectures":119,
    "level":"Intermediate Level",
    "content_duration":"12 hours",
    "published_timestamp":"2016-03-12T22:13:46Z",
    "subject":"Web Development",
    "main_technology":"react",
    "description":"The course 'Advanced React and Redux' is designed for learners interested in mastering React. It provides a comprehensive understanding of React concepts and hands-on applications. Suitable for intermediate level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your React development skills. The course includes approximately 12 hours of on-demand video content. By the end, students will be able to build complete applications and apply React skills professionally. With over 21,998 enrolled students and 3,326 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in React. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your React career. The course is available for 140, making it a great investment in your education.",
    "category":"frontend",
    "image":"react.png"
  },
  {
    "course_id":599504,
    "course_title":"Enhance Your Python Skills",
    "num_subscribers":1299,
    "num_reviews":56,
    "num_lectures":71,
    "level":"Intermediate Level",
    "content_duration":"14 hours",
    "published_timestamp":"2016-08-11T22:09:24Z",
    "subject":"Web Development",
    "main_technology":"python",
    "description":"The course 'Advanced Scalable Python Web Development Using Flask' is designed for learners interested in mastering Python. It provides a comprehensive understanding of Python concepts and hands-on applications. Suitable for intermediate level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Python development skills. The course includes approximately 14 hours of on-demand video content. By the end, students will be able to build complete applications and apply Python skills professionally. With over 1,299 enrolled students and 56 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Python. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Python career. The course is available for 120, making it a great investment in your education.",
    "category":"backend",
    "image":"python.png"
  },
  {
    "course_id":833442,
    "course_title":"Comprehensive Guide to Angular",
    "num_subscribers":17297,
    "num_reviews":3166,
    "num_lectures":111,
    "level":"All Levels",
    "content_duration":"8.5 hours",
    "published_timestamp":"2016-05-02T23:09:15Z",
    "subject":"Web Development",
    "main_technology":"angular",
    "description":"The course 'Angular (Angular 2 or 4) & NodeJS - The MEAN Stack Guide' is designed for learners interested in mastering Angular. It provides a comprehensive understanding of Angular concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Angular development skills. The course includes approximately 8.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Angular skills professionally. With over 17,297 enrolled students and 3,166 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Angular. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Angular career. The course is available for 150, making it a great investment in your education.",
    "category":"frontend",
    "image":"angular.png"
  },
  {
    "course_id":267286,
    "course_title":"Introduction to Java",
    "num_subscribers":2797,
    "num_reviews":59,
    "num_lectures":10,
    "level":"Beginner Level",
    "content_duration":"1 hour",
    "published_timestamp":"2014-08-27T11:31:44Z",
    "subject":"Web Development",
    "main_technology":"java",
    "description":"The course 'Basic Concepts of Web Development, HTTP and Java Servlets' is designed for learners interested in mastering Java. It provides a comprehensive understanding of Java concepts and hands-on applications. Suitable for beginner level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Java development skills. The course includes approximately 1 hour of on-demand video content. By the end, students will be able to build complete applications and apply Java skills professionally. With over 2,797 enrolled students and 59 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Java. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Java career. The course is available for 35, making it a great investment in your education.",
    "category":"backend",
    "image":"java.png"
  },
  {
    "course_id":1200874,
    "course_title":"Comprehensive Guide to Php",
    "num_subscribers":4001,
    "num_reviews":8,
    "num_lectures":37,
    "level":"All Levels",
    "content_duration":"4 hours",
    "published_timestamp":"2017-05-07T19:30:36Z",
    "subject":"Web Development",
    "main_technology":"php",
    "description":"The course 'Become PHP Facebook Developer: Password-Less Authentication' is designed for learners interested in mastering Php. It provides a comprehensive understanding of Php concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Php development skills. The course includes approximately 4 hours of on-demand video content. By the end, students will be able to build complete applications and apply Php skills professionally. With over 4,001 enrolled students and 8 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Php. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Php career. The course is available for 195, making it a great investment in your education.",
    "category":"backend",
    "image":"php.png"
  },
  {
    "course_id":1024844,
    "course_title":"Comprehensive Guide to Mongodb",
    "num_subscribers":251,
    "num_reviews":32,
    "num_lectures":25,
    "level":"All Levels",
    "content_duration":"3.5 hours",
    "published_timestamp":"2016-11-30T21:59:37Z",
    "subject":"Web Development",
    "main_technology":"mongodb",
    "description":"The course 'Build A Web App with VueJS, Spring Framework and MongoDB' is designed for learners interested in mastering Mongodb. It provides a comprehensive understanding of Mongodb concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Mongodb development skills. The course includes approximately 3.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Mongodb skills professionally. With over 251 enrolled students and 32 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Mongodb. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Mongodb career. The course is available for 145, making it a great investment in your education.",
    "category":"database",
    "image":"mongodb.png"
  },
  {
    "course_id":1094964,
    "course_title":"Enhance Your Django Skills",
    "num_subscribers":2669,
    "num_reviews":112,
    "num_lectures":72,
    "level":"Intermediate Level",
    "content_duration":"5.5 hours",
    "published_timestamp":"2017-04-27T19:21:11Z",
    "subject":"Web Development",
    "main_technology":"django",
    "description":"The course 'Build Your Own Backend REST API using Django REST Framework' is designed for learners interested in mastering Django. It provides a comprehensive understanding of Django concepts and hands-on applications. Suitable for intermediate level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Django development skills. The course includes approximately 5.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Django skills professionally. With over 2,669 enrolled students and 112 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Django. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Django career. The course is available for 50, making it a great investment in your education.",
    "category":"framework",
    "image":"django.png"
  },
  {
    "course_id":873844,
    "course_title":"Comprehensive Guide to Flask",
    "num_subscribers":166,
    "num_reviews":21,
    "num_lectures":37,
    "level":"All Levels",
    "content_duration":"2.5 hours",
    "published_timestamp":"2016-06-10T17:41:39Z",
    "subject":"Web Development",
    "main_technology":"flask",
    "description":"The course 'Building Web Apps Using Flask and Neo4j' is designed for learners interested in mastering Flask. It provides a comprehensive understanding of Flask concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Flask development skills. The course includes approximately 2.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Flask skills professionally. With over 166 enrolled students and 21 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Flask. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Flask career. The course is available for 50, making it a great investment in your education.",
    "category":"framework",
    "image":"flask.png"
  },
  {
    "course_id":473622,
    "course_title":"Comprehensive Guide to Typescript",
    "num_subscribers":1318,
    "num_reviews":78,
    "num_lectures":51,
    "level":"All Levels",
    "content_duration":"4.5 hours",
    "published_timestamp":"2015-04-13T19:00:50Z",
    "subject":"Web Development",
    "main_technology":"typescript",
    "description":"The course 'Comprehensive TypeScript' is designed for learners interested in mastering Typescript. It provides a comprehensive understanding of Typescript concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Typescript development skills. The course includes approximately 4.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Typescript skills professionally. With over 1,318 enrolled students and 78 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Typescript. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Typescript career. The course is available for 125, making it a great investment in your education.",
    "category":"frontend",
    "image":"typescript.png"
  },
  {
    "course_id":987064,
    "course_title":"Enhance Your Vue Skills",
    "num_subscribers":1087,
    "num_reviews":220,
    "num_lectures":32,
    "level":"Intermediate Level",
    "content_duration":"3.5 hours",
    "published_timestamp":"2016-11-07T17:53:40Z",
    "subject":"Web Development",
    "main_technology":"vue",
    "description":"The course 'Learn by Doing: Vue JS 2.0 the Right Way' is designed for learners interested in mastering Vue. It provides a comprehensive understanding of Vue concepts and hands-on applications. Suitable for intermediate level learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Vue development skills. The course includes approximately 3.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Vue skills professionally. With over 1,087 enrolled students and 220 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Vue. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Vue career. The course is available for 95, making it a great investment in your education.",
    "category":"frontend",
    "image":"vue.png"
  },
  {
    "course_id":563020,
    "course_title":"Comprehensive Guide to Swift",
    "num_subscribers":1926,
    "num_reviews":9,
    "num_lectures":458,
    "level":"All Levels",
    "content_duration":"22.5 hours",
    "published_timestamp":"2015-07-24T21:45:40Z",
    "subject":"Web Development",
    "main_technology":"swift",
    "description":"The course 'Learn to build 20 websites and build 14 iOS9 apps with swift' is designed for learners interested in mastering Swift. It provides a comprehensive understanding of Swift concepts and hands-on applications. Suitable for all levels learners, it covers both theoretical and practical aspects. Throughout the course, you’ll work with real-world projects to strengthen your Swift development skills. The course includes approximately 22.5 hours of on-demand video content. By the end, students will be able to build complete applications and apply Swift skills professionally. With over 1,926 enrolled students and 9 reviews, it’s a popular choice among developers. Students will gain experience in debugging, optimization, and modern development practices. Each module focuses on key principles of coding, architecture, and problem-solving. Interactive examples and exercises ensure a deep learning experience. Instructors provide insights into common mistakes and best practices in Swift. The course is updated regularly to stay aligned with current industry standards. Resources include coding challenges, quizzes, and downloadable materials. After completion, you’ll have a strong foundation to advance your Swift career. The course is available for 40, making it a great investment in your education.",
    "category":"backend",
    "image":"swift.png"
  },
  {
  "course_id": 563021,
  "course_title": "Mastering Next.js From Zero to Production",
  "num_subscribers": 3480,
  "num_reviews": 27,
  "num_lectures": 312,
  "level": "All Levels",
  "content_duration": "19 hours",
  "published_timestamp": "2019-10-12T17:30:00Z",
  "subject": "Web Development",
  "main_technology": "nextjs",
  "description": "The course 'Mastering Next.js From Zero to Production' is designed to help learners understand and build modern full-stack applications using the Next.js framework. It covers core concepts including file-based routing, SSR, API routes, authentication, performance optimization, and deployment strategies. With a mix of practical exercises and real-world projects, students gain hands-on experience creating production-ready applications. The course offers 19 hours of high-quality video lessons, quizzes, and coding challenges. Updated to reflect the latest Next.js features such as the App Router and Server Components. By the end, learners will be able to build scalable and optimized applications suitable for professional environments. With over 3,480 students and 27 reviews, it's a popular choice among aspiring and experienced developers. Available for 40, the course is an excellent investment for anyone looking to grow in modern frontend and full-stack development.",
  "category": "frontend",
  "image": "nextjs.png"
},
{
  "course_id": 563022,
  "course_title": "Complete Modern C++ Programming Bootcamp",
  "num_subscribers": 4120,
  "num_reviews": 34,
  "num_lectures": 520,
  "level": "All Levels",
  "content_duration": "29 hours",
  "published_timestamp": "2018-04-05T09:20:00Z",
  "subject": "Software Engineering",
  "main_technology": "cpp",
  "description": "The course 'Complete Modern C++ Programming Bootcamp' provides an in-depth journey into C++ programming from fundamentals to advanced topics. Learners will explore concepts including memory management, OOP, STL, templates, algorithms, and modern C++ features (C++11/14/17). With practical projects and hands-on coding exercises, students master writing efficient and robust applications. The bootcamp includes approximately 29 hours of content, covering real-world scenarios related to system development, game engines, and performance-critical applications. Instructors share insights on optimization, debugging, and best practices for modern C++ coding. With 4,120 enrolled students and 34 reviews, it is a top choice for those aiming to strengthen their system programming skills. The course includes quizzes, challenges, and downloadable resources. Suitable for both beginners and professionals. Available for 40, it's a valuable investment for any aspiring C++ developer.",
  "category": "backend",
  "image": "c++.png"
}
]